In [1]:
# import dependencies
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# read in all csvs
d1 = "resources/10308_fuel_use_veh_type_3-25-20.csv"
d2 = "resources/epa_transport_data.csv"
d3 = "resources/table_01_11_053019.csv"
d4 = "resources/table_01_19_120419.csv"

In [6]:
# build base dataframes
df1 = pd.read_csv(d1)
df2 = pd.read_csv(d2)
df3 = pd.read_csv(d3)
df4 = pd.read_csv(d4)

In [7]:
# df1 first round cleanup
del df1["Source"]
new_names1 = ['vehicle_type',
'mpg_gasoline',
'mpg_diesel',
'vmt',
'annual_fuel_use_gge']
df1.columns = new_names1
df1

          vehicle_type  mpg_gasoline  mpg_diesel       vmt annual_fuel_use_gge
0          Transit Bus           3.3         3.7   43,647               13,329
1        Class 8 Truck           5.3         6.0   62,751               11,818
2         Refuse Truck           2.5         2.8   25,000               10,089
3  Paratransit Shuttle           7.1         8.0   29,429                4,157
4       Delivery Truck           6.5         7.4   12,435                1,899
5           School Bus           6.2         7.0   12,000                1,937
6      Light Truck/Van          17.5        19.8   11,543                  660
7                  Car          24.2        27.3   11,467                  474
8           Motorcycle          44.0        49.7    2,312                   53

In [20]:
# df2 first round cleanup
years = []
for i in range(0,7):
    year=(2000+i)
    years.append(str(year))
df2 = df2.rename(columns={"Transportation Sector":"Type"})
df2 = df2.set_index("Type")
df2 = df2[years]
df2 = df2.drop("Total")
df2 = df2.transpose()
df2 = df2.reset_index()
new_names2 = ['year',
'fossil_fuel_combustion',
'use_of_fluorinated_gases',
'fossil_fuel_combustion:_other_greenhouse_gases',
'other_transportation_categories']
df2.columns = new_names2
df2

,year,fossil_fuel_combustion,use_of_fluorinated_gases,fossil_fuel_combustion:_other_greenhouse_gases,other_transportation_categories
0,2000,1779.394341,56.180975,53.591355,12.065090
1,2001,1758.433429,62.011726,50.283191,11.054296
2,2002,1799.859328,64.484809,47.948862,10.923330
3,2003,1792.528516,66.198738,45.367338,10.098794
4,2004,1837.152810,68.165039,42.595281,10.231172
5,2005,1856.113443,69.268511,37.860710,10.177696
6,2006,1852.744564,70.316256,36.838568,9.915832

In [26]:
# df3 first round cleanup
years = []
for i in range(0,7):
    year=(2000+i)
    years.append(str(year))
df3 = df3.rename(columns={"Unnamed: 0":"Type"})
df3 = df3.set_index("Type")
df3 = df3[years]
df3 = df3.dropna(how="any")
df3 = df3.drop(['Light duty vehicle, short wheel basec', 'Light duty vehicle, long wheel basec'])
df3 = df3.transpose()
df3 = df3.reset_index()
new_names3 = ['year','air_carrier',
 'general_aviation_active_fleet',
 'highway_total_registered_vehicles',
 'passenger_cars',
 'motorcycle',
 'other_2-axle_4-tire_vehicles',
 'truck_single-unit_2-axle_6-tire_or_more',
 'truck_combinationd',
 'bus',
 'motor_bus',
 'light_rail_cars',
 'heavy_rail_cars',
 'trolley_bus',
 'commuter_rail_cars_and_locomotives',
 'demand_responsive',
 'other',
 'class_I_freight_cars',
 'class_I_locomotive',
 'nonclass_I_freight_cars',
 'car_companies_and_shippers_freight_cars',
 'amtrak_passenger_train_car',
 'amtrak_locomotive',
 'nonself-propelled_vessels',
 'self-propelled_vessels',
 'oceangoing_self-propelled_vessels_1000_gross_tons_and_over',
 'recreational_boats']
df3.columns = new_names3
df3

,year,air_carrier,general_aviation_active_fleet,highway_total_registered_vehicles,passenger_cars,motorcycle,other_2-axle_4-tire_vehicles,truck_single-unit_2-axle_6-tire_or_more,truck_combinationd,bus,...,class_I_freight_cars,class_I_locomotive,nonclass_I_freight_cars,car_companies_and_shippers_freight_cars,amtrak_passenger_train_car,amtrak_locomotive,nonself-propelled_vessels,self-propelled_vessels,oceangoing_self-propelled_vessels_1000_gross_tons_and_over,recreational_boats
0,2000,"7,826","217,533","225,821,241","133,621,420","4,346,068","79,084,979","5,926,030","2,096,619","746,125",...,"560,154","20,028","132,448","688,194","1,894",378,"31,360","8,202",282,"12,782,143"
1,2001,"7,746","211,446","235,331,382","137,633,467","4,903,056","84,187,636","5,703,501","2,154,174","749,548",...,"499,860","19,745","125,470","688,806","2,084",401,"33,042","8,546",274,"12,876,346"
2,2002,"7,673","211,244","234,624,135","135,920,677","5,004,156","85,011,305","5,650,619","2,276,661","760,717",...,"477,751","20,506","130,590","691,329","2,896",372,"32,381","8,621",261,"12,854,054"
3,2003,"7,564","209,708","236,760,033","135,669,897","5,370,035","87,186,663","5,848,523","1,908,365","776,550",...,"467,063","20,774","124,580","687,337","1,623",442,"31,335","8,648",246,"12,794,616"
4,2004,"7,764","219,426","243,010,550","136,430,651","5,767,934","91,845,327","6,161,028","2,010,335","795,274",...,"473,773","22,015","120,169","693,978","1,211",276,"31,296","8,994",233,"12,781,476"
5,2005,"7,686","224,352","247,421,120","136,568,083","6,227,146","95,336,839","6,395,240","2,086,759","807,053",...,"474,839","22,779","120,195","717,211","1,186",258,"33,152","8,976",231,"12,942,414"
6,2006,"7,637","221,943","250,844,644","135,399,945","6,678,958","99,124,775","6,649,337","2,169,670","821,959",...,"475,415","23,732","120,688","750,404","1,191",319,"32,211","8,898",229,"12,746,126"

In [29]:
# df4 first round cleanup
df4 = pd.read_csv(d4)
df4 = df4.rename(columns={"Unnamed: 0":"Type","(R) 2000":"2000","(R) 2001":"2001","(R) 2002":"2002","(R) 2003":"2003","(R) 2004":"2004","(R) 2005":"2005","(R) 2006":"2006","(R) 2007":"2007","(R) 2008":"2008","(R) 2009":"2009","(R) 2010":"2010","(R) 2011":"2011","(R) 2012":"2012","(R) 2013":"2013","(R) 2014":"2014","(R) 2015":"2015","(R) 2016":"2016","(R) 2017":"2017"})
df4 = df4.set_index("Type")
df4 = df4.replace("Z",0)
df4 = df4.transpose()
df4 = df4.reset_index()
new_names4 = ['year',
'hybrid_electric',
'plug-in_hybrid-electric',
'electric']
df4.columns = new_names4
df4

    year hybrid_electric plug-in_hybrid-electric electric
0   2000           9,400                       0        0
1   2001          20,300                       0        0
2   2002          36,000                       0        0
3   2003          47,600                       0        0
4   2004          84,200                       0        0
5   2005         205,900                       0        0
6   2006         251,900                       0        0
7   2007         351,100                       0        0
8   2008         315,800                       0        0
9   2009         290,300                       0        0
10  2010         274,600                     300        0
11  2011         266,500                   7,700   10,100
12  2012         434,600                  38,600   14,600
13  2013         495,500                  49,000   48,100
14  2014         452,200                  55,400   63,500
15  2015         384,400                  43,000   71,100
16  2016         346,900                  72,900   86,700
17  2017         362,900                  91,100  104,400
18  2018         343,200                 122,800  238,800

In [ ]:
# create database connection
connection_string = "postgres:postgres@localhost:5432/emissions_df"
engine = create_engine(f'postgresql://{connection_string}')

In [ ]:
# Confirm tables
engine.table_names()

In [ ]:
df1.to_sql(name='premise', con=engine, if_exists='append', index=True)

In [ ]:
df2.to_sql(name='premise', con=engine, if_exists='append', index=True)

In [ ]:
df3.to_sql(name='premise', con=engine, if_exists='append', index=True)

In [ ]:
df4.to_sql(name='premise', con=engine, if_exists='append', index=True)